athompson36/lumari_watch/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# ESP32-S3R8 (Waveshare 2.06) has 8MB octal PSRAM; quad mode fails with "PSRAM ID read error"
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
